In [1]:
import pandas as pd
import numpy as np

In [17]:
data=np.arange(10)
a=data[data%2==0]
b=data[data%2!=0]
print(a, b)

[0 2 4 6 8] [1 3 5 7 9]

In [18]:
a = 10
b = (1.44,'bitamin')
c = "비타민"
d = [1, 2, 3, 4, 5]
e = {'특별시':'천안','충남':'서울','인천':'광역시'}

In [20]:
print(type(a)) # 정수형
print(type(b)) # Tupple, 리스트와 유사하지만 값을 바꿀 수 없는 immutable type
print(type(c)) # 문자열 자료, 문자, 단어 등으로 구성된 문자들의 집합
print(type(d)) # 여러 type 의 자료형을 담을 수 있는 자료형
print(type(e)) # Dictionary, key : value 쌍으로 자료를 담을 수 있는 자료형

<class 'int'>
<class 'tuple'>
<class 'str'>
<class 'list'>
<class 'dict'>

<class 'int'>
<class 'tuple'>
<class 'str'>
<class 'list'>
<class 'dict'>

In [21]:
scores = [90,25,67,45,80] 
for score in scores:
    if score >= 80:
        print('우수')
    elif score >= 60 and score < 80:
        print('보통')
    else:
        print('미흡')

우수
미흡
보통
미흡
우수

In [22]:
import seaborn as sns
titanic=sns.load_dataset('titanic')
titanic.head(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True

In [49]:
df = titanic.loc[:, ['pclass', 'fare']]
df.head(3)

   pclass     fare
0       3   7.2500
1       1  71.2833
2       3   7.9250

In [50]:
z_score = lambda x: (x-min(x))/(max(x)-min(x))

In [51]:
df['fare'] = df.apply(lambda x: z_score(df['fare']), axis=1)

df['fare'].head(3)

0    0.014151
1    0.014151
2    0.014151
Name: fare, dtype: float64

In [53]:
insurance_df = pd.read_csv('insurance2.csv')